Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རོལ་མོའི་ཤིང་ཐམས་ཅད་དང་། རོལ་མོ་བརྡུང་བའི་དབྱངས་ཐམས་ཅད་དང་། སྤྲུལ་པའི་རྒྱན་ཐམས་ཅད་ཀྱི་དམིགས་པ་རེ་རེ་ལས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་དང་། མཐུའི་སྒྲ་རབ་ཏུ་སྒྲོག་པའི་སྤོས་དང་། བདུག་སྤོས་ཐམས་ཅད་ཀྱི་སྤྲིན་མངོན་པར་འཐོན་ཏེ། རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་སྤྲིན་དང་། སྤོས་དང་བདུག་སྤོས་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་དམ་པ་དང་། སྤོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་སྤྲིན་དང་། གོས་རིན་པོ་ཆེ་དང་། རྒྱན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་རི་རབ་ཀྱི་སྤྲིན་དང་ཕྱེ་མ་སྣ་ཚོགས་ཀྱི་སྤྲིན་མང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་གཟེར་གྱི་སྤྲིན་རྣམ་པར་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་རབ་ཏུ་འགྱེད་པ།
en: They resounded with clouds of the music of all instruments and drums.

source: རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་ཐམས་ཅད་ཀྱི་སྤྲིན་ཡོངས་སུ་འཁྲོལ་ཞིང་རྡུང་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་སྒྲ་སྐད་ཀྱི་སྤྲིན་རབ་ཏུ་འབྱིན་པ།
en: They emitted clouds of the sound of the prayers of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་། གསུང་རྒྱ་མཚོའི་སྤྲིན་རབ་ཏུ་སྒྲོག་པ།
en: They resounded with clouds of the aspects of voice and the oceans of speech of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་གཟུགས་བརྙན་སྣ་ཚོགས་ཀྱི་སྤྲིན་རབ་ཏུ་སྟོན་པར་བྱེད་ཅིང་།
en: They manifested clouds of various images of the signs and features of a great being possessed by all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་འབྱུང་བའི་ལྟས་སྔོན་དུ་བྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་སྟོན་ཏེ།
en: They revealed countless omens of the coming of a tathāgata.

source: རིན་པོ་ཆེའི་རྒྱལ་པོའི་པདྨོ་ཆེན་པོའི་ལོ་མའི་མཚམས་ནས། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་རྣམ་པར་སྟོན་པའི་འོད་གཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་དེའི་པདྨོའི་འཁོར་རིན་པོ་ཆེའི་རྒྱལ་པོ་ལས་བྱས་པ་ཆེན་པོ་ཤ་སྟག་ཏུ་བྱས་ཏེ་འཁོད་དོ། །
en: “The lotus Sarva­tryadhva­tathāgata­viṣaya­patra­saṃdhi­vidyotita­megha­vyūha had a retinue of great lotuses that were all made of the kings of jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོའིཔདྨོ་ཆེན་པོའི་འཁོར་ཀྱི་རིན་པོ་ཆེའི་པད་མོ་ཆེན་པོ་དེ་དག་གི་ཟེ་བ་དང་། སྙིང་པོ་ལ་སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་པདྨོ་ཆེན་པོའི་སྙིང་པོ་ཅན།
en: On the filaments and pericarps of the great lotuses that were the retinue of the great lotus made of the kings of jewels, there were precious lion thrones with great lotuses in their centers.

source: སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་བྱུང་བར་གྱུར་ཏེ།
en: They were as numerous as the atoms in ten buddha realms.

source: རིན་པོ་ཆེའི་སྙིང་པོ་ཅན་གྱི་ཁྲི་དེ་དག་ལའང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་མ་ཐག་ཏུ་དེའི་མོད་ལ།
en: As many bodhisattvas as there are atoms in ten buddha realms were seated cross-legged around those thrones with a precious center.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དེ་བཞིན་གཤེགས་པ་མང་པོ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གྱུར་ཏོ། །
en: “The moment that tathāgata, the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja, attained the highest, complete enlightenment of buddhahood, many tathāgatas in world realms in the ten directions also attained the highest, complete enlightenment of buddhahood and, in accordance with the dispositions of beings, turned the wheel of the Dharma.

source: དེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ངན་སོང་དང་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་གོ །
en: “The countless beings in those world realms were turned away from all lower realms and downfalls.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་མཐོ་རིས་སུ་སྐྱེ་བ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were brought to rebirth in the higher realms.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཉན་ཐོས་ཀྱི་ས་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the level of the śrāvakas.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Countless beings were ripened for the enlightenment of the pratyeka­buddhas.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཤུགས་དྲག་པོའི་འོད་ཀྱིས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Countless beings were ripened for the enlightenment that arises in the light of power.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བརྩོན་འགྲུས་དྲི་མ་མེད་པའི་རྒྱལ་མཚན་གྱི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Countless beings were ripened for enlightenment in the banner of stainless diligence.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཆོས་རབ་ཏུ་བསྒོམ་པའི་གནས་སུ་བྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the enlightenment that arises in dwelling in meditation on the Dharma.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་དབང་པོ་ཡོངས་སུ་དག་པ་རབ་ཏུ་བསྒོམས་པས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Countless beings were ripened for the enlightenment that arises in meditation on the purification of the faculties.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་སྟོབས་མཉམ་པ་ཉིད་ལ་ཡང་དག་པར་སྤྱོད་པ་ཁོང་དུ་ཆུད་པས་འབྱུང་བའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Countless beings were ripened for the enlightenment that arises in comprehending the practice of the equanimity of strength.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཆོས་ཀྱི་གྲོང་ཁྱེར་མངོན་དུ་འགྱུར་བའི་ཡུལ་གྱི་ཐེག་བ་སྐྱེ་པས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the enlightenment that arises in the emergence of the yāna with its field of attention turned toward the city of the Dharma.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བའི་རྫུ་འཕྲུལ་ཐ་མི་དད་པའི་ཚུལ་གྱི་ཐེག་པས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the enlightenment that arises in the yāna of the ways of various miraculous manifestations that pervade everywhere.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་སྤྱོད་པའི་སྦྱོར་བ་ལ་ཡང་དག་པར་གཞོལ་བའི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the enlightenment that arises in the way of being dedicated to practice.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཏིང་ངེ་འཛིན་གྱིས་འཇུག་པའི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །སེམས་ཅན་ཚད་མེད་པ་ནི་དམིགས་པའི་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་དག་པའི་དཀྱིལ་འཁོར་གྱི་ཚུལ་གྱིས་འབྱུང་བའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the enlightenment that arises in the ways of entering samādhi.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Countless beings developed the aspiration for the enlightenment of the bodhisattvas.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the bodhisattva path.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་རྣམ་པར་དག་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the pure path of the perfections.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the first bodhisattva bhūmi.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་དང་། གསུམ་པ་དང་བཞི་པ་དང་ལྔ་པ་དང་། དྲུག་པ་དང་བདུན་པ་དང་། བརྒྱད་པ་དང་དགུ་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the second, third, fourth, fifth, sixth, seventh, eighth, and ninth bodhisattva bhūmis.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established on the tenth bhūmi.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྨོན་ལམ་གྱི་ཁྱད་པར་ཅན་ལ་བཙུད་དོ། །
en: Countless beings were brought into the preeminent conduct and prayers of the bodhisattvas.

source: སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་རྣམ་པར་དག་པ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Countless beings were established in the completely good conduct and prayers of the bodhisattvas.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ། །
en: “In that way, the Tathāgata turned the wheel of the Dharma through the inconceivable miraculous manifestations and the power of the preeminence of a buddha, so that in each instant of mind he guided realms of beings without end or center.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་སྣ་ཚོགས་དང་། ཐབས་མཁས་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲུབས་པའི་ཆོས་བསྟན་པ་ཡོངས་སུ་ཤེས་པར་གྱུར་ཏེ།
en: “All the beings of that world realm understood the Dharma taught by that tathāgata through various bodies and the accomplishment of various skillful methods.

source: རྒྱལ་པོའི་ཕོ་བྲང་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མའི་སེམས་ཅན་གཟུགས་དང་། ཁ་དོག་དང་ཡུལ་དང་ལོངས་སྤྱོད་ཀྱིས་རྒྱགས་ཤིང་དྲེགས་ཏེ་གཅིག་ལ་གཅིག་ཁྱད་དུ་གསོད་པ་དེ་རྣམས་གདུལ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཁ་དོག་དང་གཟུགས་མཆོག་ཏུ་ཕྱིན་པར་མངོན་པར་སྤྲུལ་ཏེ། རྒྱལ་པོའི་ཕོ་བྲང་དེར་ཕྱིན་ཏོ། །
en: “In order to guide those beings in the royal capital Ratna­kusuma­pradīpā, who were proud and arrogant because of their form, color, scope, and enjoyments and had no care for one another, the bodhisattva Samanta­bhadra manifested a supreme color and form and went to the royal capital.

source: དེའི་འོད་ཤིན་ཏུ་ཡངས་པས་རྒྱལ་པོའི་གནས་དེ་དག་ཐམས་ཅད་དུ་ཡོངས་སུ་སྣང་བར་གྱུར་ཏེ། རྒྱལ་པོའི་གནས་དེའི་འོད་དང་།
en: His halo was so vast that it illuminated the entire royal capital.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོའི་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོའི་ལུས་ལས་བྱུང་བའི་འོད་དང་། བུད་མེད་རིན་པོ་ཆེའི་འོད་དང་། རིན་པོ་ཆེའི་ཤིང་གི་འོད་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་འོད་དང་། གཉི་ཟླ་དང་གཟའ་སྐར་དང་རྒྱུ་སྐར་གྱི་འོད་དང་།
en: “The light of the royal capital, the light from the body of the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa, the light from the precious queen, the light from the precious trees, the light from the precious jewels, the light from the sun, moon, planets, and stars, and whatever lights there were in Jambudvīpa all ceased to shine.

source: འཛམ་བུའི་གླིང་ན་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མི་སྣང་བར་གྱུར་ཏེ། དཔེར་ན་ཉི་མ་ཤར་ཏེ་མུན་པ་དང་། ཟླ་བ་དང་གཟའ་སྐར་དང་། རྒྱུ་སྐར་གྱི་འོད་ཀྱང་མི་སྣང་ལ་མེ་དང་ནོར་བུའི་འོད་ཀྱང་མི་སྣང་ངོ་། །
en: “For example, when the sun shines, darkness and the light of the moon, planets, stars, and constellations vanish, and the light from fire and jewels vanishes.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཟིལ་གྱིས་ནོན་ནས་འཛམ་བུའི་གླིང་དེ་ན་འོད་ཡོད་པ་ཐམས་ཅད་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ། །
en: In the same way, through being outshined by the bodhisattva Samanta­bhadra, all the lights in Jambudvīpa vanished.

source: འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ས་ལེ་སྦྲམ་གྱི་དྲུང་དུ་སྣག་ཚའི་གཟུགས་བཞག་ན་མཛེས་པར་མི་རུང་། ལྷ་གེར་མི་རུང་། ལྷ་མེར་མི་རུང་།
en: “It is just as if, for example, you were to place some lampblack in front of a lump of Jambu River gold, it would not be beautiful, would not be bright, would not glow, and would not shine.

source: ལྷ་དེར་མི་རུང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོའི་མདུན་དུ་སེམས་ཅན་དེ་དག་གི་གཟུགས་ཀྱི་ལུས་ཀྱང་མཛེས་པར་མ་རུང་། ལྷ་གེར་མ་རུང་། ལྷ་མེར་མ་རུང་། ལྷ་དེར་མ་རུང་ངོ་། །
en: In the same way, when the physical forms of those beings were in front of the bodhisattva Samanta­bhadra, they were not beautiful, were not bright, were not glowing, and were not shining.

source: དེ་ནས་དེ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ། དེ་ལྟ་བུ་ཞིག་དེ་ལྟར་དེའི་དྲུང་དུ་བདག་ཅག་གི་ལུས་སམ། འོད་དམ་ཁ་དོག་གམ། གཟི་བརྗིད་ཀྱིས་ཀྱང་མཛེས་པར་མ་རུང་། ལྷ་གེར་མ་རུང་། ལྷ་མེར་མ་རུང་།
en: “They thought, ‘In front of him our bodies, light, color, and brilliance are not beautiful, not bright, not glowing, and they do not shine.

source: ལྷ་དེར་མ་རུང་བ་དེ་ལྟ་ལྷའམ། ཚངས་པའམ། ཅི་ཞིག་དེའི་མཚན་མ་ནི་གཟུང་བར་མི་ནུས་སོ་སྙམ་མོ། །
en: Is this a deva or Brahmā whose attributes we are unable to comprehend?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མའི་དབུས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོའི་གཞལ་མེད་ཁང་གི་སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ།
en: “Then the bodhisattva Samanta­bhadra stood in the sky above the aerial palace of the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa, which was in the center of the royal capital Ratna­kusuma­pradīpā.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཤེས་པར་གྱིས་ཤིག །
en: He said to the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa, ‘Great king, know this!

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: A tathāgata arhat samyak­saṃbuddha has appeared in this world.

source: ཁྱོད་ཀྱི་ཁམས་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀུན་ཏུ་སྣང་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་སྒྲ་དབྱངས་རྒྱལ་མཚན་འདི་ཉིད་ན་རྣམ་པར་སྤྱོད་དོ་ཞེས་པ་དང་།
en: He is dwelling in your land, at the bodhimaṇḍa called Samantāvabhāsana­dharma­megha­nirghoṣa­dhvaja.’

source: རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འཕྲོ་བ་པདྨོ་བཟང་པོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོའི་གཟུགས་ཀྱི་ལུས་དང་། འོད་དང་རྣམ་པར་འཕྲུལ་པ་དང་རྒྱན་མཐོང་སྟེ། དབྱངས་ཐོས་ནས་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ།
en: “When the king’s daughter, Samanta­jñānārci­padma­bhadrābhirāma­netra­śrī­candrā, saw the bodhisattva Samanta­bhadra’s body, light, miracles, and adornments and heard his voice, she experienced a powerful happiness and delight.

source: དེའི་ཚེ་སེམས་འདི་སྙམ་དུ་བསྐྱེད་དོ། །བདག་གིས་དགེ་བའི་རྩ་བ་གང་ཅི་བསྩགས་པ་དེས་བདག་ཀྱང་ལུས་འདི་འདྲ་བར་ཐོབ་པར་ཤོག་ཤིག །
en: “At that time, she thought, ‘May I, through whatever roots of merit I accumulate, attain a body like that!

source: རྒྱན་འདི་འདྲ་བ་དང་། མཚན་འདི་འདྲ་བ་དང་། སྤྱོད་ལམ་འདི་འདྲ་བ་དང་། རྫུ་འཕྲུལ་འདི་འདྲ་བར་ཤོག་ཤིག །
en: May I have that kind of jewelry, those kinds of characteristics, that kind of conduct, and those kinds of miraculous powers!

source: ཇི་ལྟར་འདིས་མཚན་མོ་མུན་ནག་གི་ནང་ན་སེམས་ཅན་རྣམས་ལ་སྣང་བ་ཆེན་པོ་བསྐྱེད་དེ། སངས་རྒྱས་སྐྱེ་བ་ཡོངས་སུ་བརྗོད་པ་དེ་བཞིན་དུ། བདག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་མི་ཤེས་པའི་མུན་པ་བསྩལ་ཏེ་ཡེ་ཤེས་ཆེན་པོ་འདི་སྣང་བསྐྱེད་པར་བྱའོ། །
en: Just as he has brought a great light for beings in the darkness of night and told them of the birth of a buddha, so may I dispel the darkness of ignorance in beings and bring them the light of great wisdom!

source: གང་དང་གང་དུ་སྐྱེས་པ་ཐམས་ཅད་དུའང་དགེ་བའི་བཤེས་གཉེན་འདི་དང་མི་འབྲལ་བར་ཤོག་ཤིག །
en: Wherever I am reborn, may I never in all those lives be separated from this kalyāṇamitra!’

source: དེ་ནས་རིགས་ཀྱི་བུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ཡན་ལག་བཞིའི་དཔུང་གི་ཚོགས་དང་ལྷན་ཅིག །རིན་པོ་ཆེ་བདུན་དང་ལྷན་ཅིག །བུད་མེད་ཀྱི་ཚོགས་ཀྱི་འཁོར་དང་ལྷན་ཅིག་བུ་དང་བློན་པོ་དང་། ལྗོངས་ཀྱི་མི་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མ་དེ་ནས་འཕགས་ཏེ་གྱེན་ཏུ་ནམ་མཁའ་ལ་དཔག་ཚད་གཅིག་ཙམ་དུ་མངོན་པར་འཕགས་ནས།
en: “Then, noble one, the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa, with the four divisions of his army, with his seven jewels, with his retinue of women, and with his ministers and the people of his land, through the king’s miraculous powers, through the great might of the king, rose up into the sky above the royal capital Ratna­kusuma­pradīpā to a height of one yojana.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་རྒྱས་པར་བཀང་སྟེ།
en: He filled the whole of Jambudvīpa and the entire four-continent world with a great light.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་བལྟ་བ་ལ་ཡོངས་སུ་བསྐུལ་བའི་དོན་དུ་རིན་པོ་ཆེའི་རི་ཐམས་ཅད་ལ་གཟུགས་བརྙན་མངོན་པར་བསྟན་ཅིང་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ལ་མངོན་སུམ་དུ་གནས་ཏེ་སངས་རྒྱས་ལ་བལྟ་བ་དེ་ཚིགས་སུ་བཅད་དེ་གླུའི་དབྱངས་ཀྱིས་བསྔགས་པ། །ལུས་ཅན་ཐམས་ཅད་སྐྱབས་མཛད་པའི། །སངས་རྒྱས་འཇིག་རྟེན་བྱུང་བར་གྱུར། །
en: In order to encourage all beings to come and see the Buddha, he manifested his image on all the precious mountains and became present before all beings in the four-continent world realm and sang a song of verses that praised seeing the Buddha: “ ‘Into the world has come a buddha Who will be a savior for all who have bodies.

source: འཇིག་རྟེན་གཙོ་བོ་དེ་བལྟ་བར། །ཀུན་ཀྱང་ལངས་ཏེ་འདོང་བར་གྱིས། །
en: Everyone should rise and set forth In order to see that lord of the world!

source: ལུས་ཅན་ཀུན་ལ་ཕན་དོན་དུ། །ཆོས་རབ་སྟོན་པར་གང་མཛད་པའི། །དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་ནི། །བསྐལ་པ་བྱེ་བའི་བརྒྱ་ལམ་ནའོ། །
en: {20} “ ‘The appearance of a tathāgata, Someone who teaches the Dharma In order to benefit all who have bodies, May occur only once in a billion kalpas.

source: འཇིག་རྟེན་ཕྱིན་ཅིར་ལོག་གྱུར་ཅིང་། །མི་ཤེས་སྒྲིབ་པས་བསྒྲིབས་གྱུར་ཏེ། །འཁོར་བའི་སྡུག་བསྔལ་མྱོང་པ་རྣམས། །གཟིགས་ཤིང་ཐུགས་རྗེ་ཆེ་བསྐྱེད་ནས། །
en: {21} “ ‘He developed compassion on seeing The world having gone astray, Obscured by the darkness of ignorance And experiencing the suffering of saṃsāra.

source: སྡུག་བསྔལ་ཐམས་ཅད་གཞིལ་དོན་དུ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །བྱང་ཆུབ་སྤྱོད་པ་སྤྱད་པ་མཛད།
en: {22} “ ‘In order to ripen beings So as to extinguish all suffering, He practiced enlightened conduct For countless millions of kalpas.

source: བསྐལ་པ་མཐའ་ཡས་མུ་མེད་པར། །སངས་རྒྱས་བྱང་ཆུབ་མཆོག་དོན་དུ། །ཞབས་དང་ཕྱག་ཀྱང་ཡོངས་སུ་བཏང་། །སྤྱན་དང་སྙན་དང་དབུ་ཡང་བཏང་། །
en: {23} “ ‘For limitless, endless kalpas, For the sake of the supreme enlightenment of buddhahood, He gave away his legs and his arms, And he also gave away his eyes, ears, and head.

source: མཐོང་ཞིང་བསྙེན་བཀུར་བྱས་པ་དང་། །ཐོས་པ་དོན་ཡོད་འགྱུར་བ་ཡིན། །
en: {24} “ ‘To see him, honor him, And hear him will be beneficial.

source: འཇིག་རྟེན་མགོན་པོ་འཇིག་རྟེན་དུ། །འབྱུང་བ་བསྐལ་པ་བྱེ་བར་དཀོན།
en: It is rare even in ten million kalpas For a lord of the world to appear in the world.

source: དེ་ནི་བྱང་ཆུབ་གདན་ལ་བཞུགས། །
en: {25} “ ‘He is dwelling at the seat of enlightenment.

source: གསུང་བའི་དམ་པ་བལྟར་ཡང་ཡོད། །
en: He is there like a supreme secret.

source: བདུད་རྣམས་སྡེ་དང་བཅས་བཏུལ་ཏེ། །བྱང་ཆུབ་མཆོག་ཏུ་རྣམ་སངས་རྒྱས། །
en: He has subjugated Māra and his armies And attained the supreme enlightenment of buddhahood.

source: འོད་གཟེར་དཀྱིལ་འཁོར་མཐའ་ཡས་པ། །སངས་རྒྱས་སྐུ་ལས་མངོན་བཀྱེ་ཞིང་། །
en: {26} “ ‘There is an infinite aura of light That radiates from the Buddha’s body.

source: འགྲོ་བ་ཚིམ་པར་མཛད་པ་ཡི། །ཁ་དོག་སྣ་ཚོགས་འདི་ལ་ལྟོས། །
en: Come see its various colors That bring satisfaction to beings.

source: འོད་ཟེར་སྤྲིན་མང་གྲངས་མེད་པ། །སངས་རྒྱས་སྐུ་ལས་འཐོན་པ་རྣམས། །
en: {27} “ ‘There are countless clouds of light rays That come from the Buddha’s body.

source: དེས་ནི་སེམས་ཅན་སྣང་གྱུར་ན། །བདེ་བ་དཔེ་མེད་འཐོབ་པར་འགྱུར། །
en: Those beings upon whom they shine Attain an unparalleled happiness.

source: བརྩོན་འགྲུས་ཆེན་པོ་རབ་རྩོམ་སྟེ། །
en: {28} “ ‘Develop great diligence.

source: རང་དང་རང་གི་བསམ་པ་ཡིས། །མགོན་པོ་དེ་ལ་མཆོད་པ་གྱིས། །
en: And each according to your wishes, Make offerings to that protector.

source: ཚུར་ཤེག་དེ་ཡི་གན་དུ་འདོང་། །
en: Come! And go into his presence!’

source: དེ་ནས་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོས་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་བདག་གི་ཁམས་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐུལ་ཏེ། མཆོད་པའི་སྤྲིན་སྣ་ཚོགས་བརྒྱ་སྟོང་ཕྲག་བཅུ་འཁོར་ལོས་སྒྱུར་བའི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་གྲུབ་པའི་ཆར་པ། སྙིང་པོ་བྱང་ཆུབ་ཀུན་ནས་ལྡང་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་དབྱངས་ཀྱི་རྒྱལ་མཚན་གྱི་འཁོར་ཀུན་ཏུ་མངོན་པར་འབེབས་ཤིང་།
en: {29} “After King Vairocana­ratna­padma­garbha­śrī­cūḍa had thus encouraged all the beings in his realm with those verses, the cakravartin’s roots of merit created a rain of a million clouds of various offerings that descended onto the bodhimaṇḍa Samantāvabhāsana­dharma­megha­nirghoṣa­dhvaja.

source: རིན་པོ་ཆེའི་གདུགས་ཀྱི་སྤྲིན་གྱི་ནམ་མཁའ་ཀུན་ནས་ཡོག་པར་བྱ་བ་དང་།
en: Clouds of precious parasols covered the entire sky.

source: མེ་ཏོག་ཐམས་ཅད་ཀྱི་བླ་རེའི་སྤྲིན་གྱིས་ནམ་མཁའ་བླ་ནས་ཁེབ་པར་བྱ་བ་དང་།
en: Clouds of canopies of all flowers were spread above.

source: ན་བཟའ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ནམ་མཁའ་ཀུན་ནས་ཡོག་ཅིང་བརྒྱན་པར་བྱ་བ་དང་།
en: Clouds of all kinds of food covered and adorned the sky.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲིལ་བུའི་དྲ་བའི་སྤྲིན་གྱིས་ནམ་མཁའི་དབྱིངས་བརྒྱན་པར་བྱ་བ་དང་།
en: Clouds of nets of bells of various jewels adorned the expanse of the sky.

source: སྤོས་སྣ་ཚོགས་རྒྱ་མཚོས་དྲི་ཞིམ་པར་བྱས་པའི་སྤོས་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པར་བྱ་བ་དང་།
en: The adornment of clouds of light rays of perfume that had been perfumed by an ocean of various perfumes was present throughout the expanse of the sky.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁྲི་ལ་རིན་པོ་ཆེའི་གདན་འབེལ་བར་བཏིང་བའི་སྤྲིན་གྱི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་ཀྱིས་བརླབ་པ་དང་།
en: The adornment of clouds of thrones made of all jewels with seats that were precious cushions was present throughout the expanse of the sky.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་གྱི་སྤྲིན་མངོན་པར་བསྒྲེང་བའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་།
en: The adornment of clouds of upright banners, made of all jewels, was present throughout the expanse of the sky.

source: ཁང་པ་དང་གཞལ་མེད་ཁང་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་།
en: The all-covering adornment of clouds of mansions and aerial palaces was present throughout the sky.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་།
en: The all-covering adornment of clouds of various flowers was present throughout the sky.

source: མཆོད་པའི་རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་བྱེད་ཅིང་།
en: The adornment of rain from clouds of every display of offerings was present throughout the sky.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: “The king approached the location of the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Having arrived, he bowed his head to the feet of the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then with the Bhagavat to his right, he circumambulated him many hundreds of thousands of times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྟན་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་པདྨོའི་སྙིང་པོ་ཅན་ལ་འདུག་གོ །
en: He then sat before the Bhagavat upon a seat that had as its center a great lotus of precious jewels that shined light into the ten directions.

source: དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་བུ་མོ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བས་རང་གི་རྒྱན་རྣམས་ལུས་ལས་བཀྲོལ་ཏེ།
en: “Then the cakravartin’s daughter, Padma­bhadrābhirāma­netra­śrī­candrā, removed the jewelry from her body and scattered it over the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་དུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་ལ་གཏོར་ཏོ་མངོན་པར་གཏོར་ཏོ། །
en: “She saw that the jewelry became a great parasol of jewelry made of precious jewels that was situated in the air above the crown of the Bhagavat’s head.

source: དེ་ནས་རྒྱན་དེ་དག་བཅོམ་ལྡན་འདས་དེའི་དབུའི་གཙུག་གི་སྟེང་གི་བར་སྣང་ལ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་གྱི་གདུགས་ཆེན་པོ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཡོངས་སུ་བསྐོར་བ་ཀླུའི་དབང་པོའི་ལུས་ཀྱིས་གཟུང་བ་རྒྱན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱིས་དབྱིབས་ཤིན་ཏུ་ལེགས་པར་ཀུན་ནས་བསྐོར་བ། རྒྱན་གྱི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་བཅུས་ཡོངས་སུ་བསྐོར་བ།
en: Around its border hung a net of various jewels, it was held by a lord of the nāgas, its round form was composed of all the jewelry, and it was surrounded by a circle of ten parasols made of jewelry.

source: ཤིན་ཏུ་དག་པ་ཁང་པ་བརྩེགས་པའི་དབྱིབས་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: There was also a beautiful display of a completely pure variety of kūṭāgāras.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ལྷབ་ལྷུབ་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པ།
en: There was a covering of clouds of every jewel adornment.
